app/controllers/waypoints_controller.rb

SELECT * FROM "waypoints"
---
  def index
    @waypoints = Waypoint.all

SELECT * FROM "waypoints" WHERE ("waypoints"."id" = 1)
---
  def show
    @waypoint = Waypoint.find(params[:id])

SELECT * FROM "waypoints" WHERE ("waypoints"."id" = 1)
---
  def edit
    @waypoint = Waypoint.find(params[:id])

INSERT INTO "waypoints" ("name", "location", "created_at", "latitude", "title", "photos", "updated_at", "icon", "description", "longitude") VALUES('Roach', '450 Marsh AVE, reno nv 89509', '2010-04-13 01:13:32', 39.5190112, 'Auburn Statues', NULL, '2010-04-13 01:13:32', NULL, 'None', -119.8165062)
---
  def create
    @waypoint = Waypoint.new(params[:waypoint])

    respond_to do |format|
      if @waypoint.save

SELECT * FROM "waypoints" WHERE ("waypoints"."id" = 1)
UPDATE "waypoints" SET "updated_at" = '2010-11-11 02:47:13', "location" = '450 Marsh Ave, reno nv 89509' WHERE "id" = 1
---
  def update
    @waypoint = Waypoint.find(params[:id])

    respond_to do |format|
      if @waypoint.update_attributes(params[:waypoint])